prusa3d/Prusa-Firmware-Buddy/lib/CycloneTCP/drivers/mac/mimxrt1170_eth2_driver.c
/**
 * @file mimxrt1170_eth2_driver.c
 * @brief NXP i.MX RT1170 Ethernet MAC driver (ENET_1G instance)
 *
 * @section License
 *
 * SPDX-License-Identifier: GPL-2.0-or-later
 *
 * Copyright (C) 2010-2021 Oryx Embedded SARL. All rights reserved.
 *
 * This file is part of CycloneTCP Open.
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License
 * as published by the Free Software Foundation; either version 2
 * of the License, or (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software Foundation,
 * Inc., 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301, USA.
 *
 * @author Oryx Embedded SARL (www.oryx-embedded.com)
 * @version 2.0.4
 **/

//Switch to the appropriate trace level
#define TRACE_LEVEL NIC_TRACE_LEVEL

//Dependencies
#include "fsl_device_registers.h"
#include "fsl_gpio.h"
#include "fsl_iomuxc.h"
#include "core/net.h"
#include "drivers/mac/mimxrt1170_eth2_driver.h"
#include "debug.h"

//Underlying network interface
static NetInterface *nicDriverInterface;

//IAR EWARM compiler?
#if defined(__ICCARM__)

//TX buffer
#pragma data_alignment = 64
#pragma location = MIMXRT1170_ETH2_RAM_SECTION
static uint8_t txBuffer[MIMXRT1170_ETH2_TX_BUFFER_COUNT][MIMXRT1170_ETH2_TX_BUFFER_SIZE];
//RX buffer
#pragma data_alignment = 64
#pragma location = MIMXRT1170_ETH2_RAM_SECTION
static uint8_t rxBuffer[MIMXRT1170_ETH2_RX_BUFFER_COUNT][MIMXRT1170_ETH2_RX_BUFFER_SIZE];
//TX buffer descriptors
#pragma data_alignment = 64
#pragma location = MIMXRT1170_ETH2_RAM_SECTION
static uint32_t txBufferDesc[MIMXRT1170_ETH2_TX_BUFFER_COUNT][8];
//RX buffer descriptors
#pragma data_alignment = 64
#pragma location = MIMXRT1170_ETH2_RAM_SECTION
static uint32_t rxBufferDesc[MIMXRT1170_ETH2_RX_BUFFER_COUNT][8];

//ARM or GCC compiler?
#else

//TX buffer
static uint8_t txBuffer[MIMXRT1170_ETH2_TX_BUFFER_COUNT][MIMXRT1170_ETH2_TX_BUFFER_SIZE]
   __attribute__((aligned(64), __section__(MIMXRT1170_ETH2_RAM_SECTION)));
//RX buffer
static uint8_t rxBuffer[MIMXRT1170_ETH2_RX_BUFFER_COUNT][MIMXRT1170_ETH2_RX_BUFFER_SIZE]
   __attribute__((aligned(64), __section__(MIMXRT1170_ETH2_RAM_SECTION)));
//TX buffer descriptors
static uint32_t txBufferDesc[MIMXRT1170_ETH2_TX_BUFFER_COUNT][8]
   __attribute__((aligned(64), __section__(MIMXRT1170_ETH2_RAM_SECTION)));
//RX buffer descriptors
static uint32_t rxBufferDesc[MIMXRT1170_ETH2_RX_BUFFER_COUNT][8]
   __attribute__((aligned(64), __section__(MIMXRT1170_ETH2_RAM_SECTION)));

#endif

//TX buffer index
static uint_t txBufferIndex;
//RX buffer index
static uint_t rxBufferIndex;


/**
 * @brief i.MX RT1170 Ethernet MAC driver (ENET_1G instance)
 **/

const NicDriver mimxrt1170Eth2Driver =
{
   NIC_TYPE_ETHERNET,
   ETH_MTU,
   mimxrt1170Eth2Init,
   mimxrt1170Eth2Tick,
   mimxrt1170Eth2EnableIrq,
   mimxrt1170Eth2DisableIrq,
   mimxrt1170Eth2EventHandler,
   mimxrt1170Eth2SendPacket,
   mimxrt1170Eth2UpdateMacAddrFilter,
   mimxrt1170Eth2UpdateMacConfig,
   mimxrt1170Eth2WritePhyReg,
   mimxrt1170Eth2ReadPhyReg,
   TRUE,
   TRUE,
   TRUE,
   FALSE
};


/**
 * @brief i.MX RT1170 Ethernet MAC initialization
 * @param[in] interface Underlying network interface
 * @return Error code
 **/

error_t mimxrt1170Eth2Init(NetInterface *interface)
{
   error_t error;
   uint32_t value;

   //Debug message
   TRACE_INFO("Initializing i.MX RT1170 Ethernet MAC (ENET_1G)...\r\n");

   //Save underlying network interface
   nicDriverInterface = interface;

   //Enable ENET_1G peripheral clock
   CLOCK_EnableClock(kCLOCK_Enet_1g);

   //GPIO configuration
   mimxrt1170Eth2InitGpio(interface);

   //Reset ENET_1G module
   ENET_1G->ECR = ENET_ECR_RESET_MASK;
   //Wait for the reset to complete
   while((ENET_1G->ECR & ENET_ECR_RESET_MASK) != 0)
   {
   }

   //Receive control register
   ENET_1G->RCR = ENET_RCR_MAX_FL(MIMXRT1170_ETH2_RX_BUFFER_SIZE) |
      ENET_RCR_RGMII_EN_MASK | ENET_RCR_MII_MODE_MASK;

   //Transmit control register
   ENET_1G->TCR = 0;
   //Configure MDC clock frequency
   ENET_1G->MSCR = ENET_MSCR_HOLDTIME(10) | ENET_MSCR_MII_SPEED(120);

   //Valid Ethernet PHY or switch driver?
   if(interface->phyDriver != NULL)
   {
      //Ethernet PHY initialization
      error = interface->phyDriver->init(interface);
   }
   else if(interface->switchDriver != NULL)
   {
      //Ethernet switch initialization
      error = interface->switchDriver->init(interface);
   }
   else
   {
      //The interface is not properly configured
      error = ERROR_FAILURE;
   }

   //Any error to report?
   if(error)
   {
      return error;
   }

   //Set the MAC address of the station (upper 16 bits)
   value = interface->macAddr.b[5];
   value |= (interface->macAddr.b[4] << 8);
   ENET_1G->PAUR = ENET_PAUR_PADDR2(value) | ENET_PAUR_TYPE(0x8808);

   //Set the MAC address of the station (lower 32 bits)
   value = interface->macAddr.b[3];
   value |= (interface->macAddr.b[2] << 8);
   value |= (interface->macAddr.b[1] << 16);
   value |= (interface->macAddr.b[0] << 24);
   ENET_1G->PALR = ENET_PALR_PADDR1(value);

   //Hash table for unicast address filtering
   ENET_1G->IALR = 0;
   ENET_1G->IAUR = 0;
   //Hash table for multicast address filtering
   ENET_1G->GALR = 0;
   ENET_1G->GAUR = 0;

   //Disable transmit accelerator functions
   ENET_1G->TACC = 0;
   //Disable receive accelerator functions
   ENET_1G->RACC = 0;

   //Use enhanced buffer descriptors
   ENET_1G->ECR = ENET_ECR_DBSWP_MASK | ENET_ECR_EN1588_MASK;

   //Reset statistics counters
   ENET_1G->MIBC = ENET_MIBC_MIB_CLEAR_MASK;
   ENET_1G->MIBC = 0;

   //Initialize buffer descriptors
   mimxrt1170Eth2InitBufferDesc(interface);

   //Clear any pending interrupts
   ENET_1G->EIR = 0xFFFFFFFF;
   //Enable desired interrupts
   ENET_1G->EIMR = ENET_EIMR_TXF_MASK | ENET_EIMR_RXF_MASK | ENET_EIMR_EBERR_MASK;

   //Set priority grouping (4 bits for pre-emption priority, no bits for subpriority)
   NVIC_SetPriorityGrouping(MIMXRT1170_ETH2_IRQ_PRIORITY_GROUPING);

   //Configure ENET_1G interrupt priority
   NVIC_SetPriority(ENET_1G_IRQn, NVIC_EncodePriority(MIMXRT1170_ETH2_IRQ_PRIORITY_GROUPING,
      MIMXRT1170_ETH2_IRQ_GROUP_PRIORITY, MIMXRT1170_ETH2_IRQ_SUB_PRIORITY));

   //Enable Ethernet MAC
   ENET_1G->ECR |= ENET_ECR_ETHEREN_MASK;
   //Instruct the DMA to poll the receive descriptor list
   ENET_1G->RDAR = ENET_RDAR_RDAR_MASK;

